{
  "id": "es_q_u_e_v_a_s_h_a_c_e_r_h_o_y",
  "title": "Q U E V A S H A C E R H O Y ?",
  "artist": "Omar Courtz feat. De La Rose",
  "level": "B2 (Upper Intermediate)",
  "from_language": "es",
  "to_language": "en",
  "audio": "/audio/es_q_u_e_v_a_s_h_a_c_e_r_h_o_y.mp3",
  "duration": 224,
  "licensing_note": "Lyrics fetched via Musixmatch API; translations via local Ollama.",
  "lines": [
    {
      "time": 0.0,
      "text": "Como nunca, hacerlo como - (yeah, yeah)",
      "translation": "Like never before, do it like - (yeah, yeah)",
      "grammar": "The phrase \"hacerlo como\" is an idiomatic expression meaning \"to do something in a certain way\", with the verb \"hacer\" in the infinitive form and the pronoun \"lo\" agreeing with the preceding noun."
    },
    {
      "time": 3.19,
      "text": "Vamos-vamos a hacerlo, hacerlo como nunca",
      "translation": "Let's do it, let's do it like never before",
      "grammar": "The phrase \"Vamos-vamos\" is an idiomatic expression used to emphasize the speaker's determination and enthusiasm, equivalent to saying \"Come on, let's go!\" in English. The repetition of \"hacerlo\" in the second part of the sentence creates a sense of urgency and emphasizes the idea that this will be done unlike anything before."
    },
    {
      "time": 6.861,
      "text": "Y como nunca, hacerlo como - (yeah, yeah)",
      "translation": "And like never before, do it like - (yeah, yeah)",
      "grammar": "This line uses the present perfect tense (\"nunca\" means \"never before\") to emphasize the uniqueness of the experience. The phrase \"hacerlo como\" is an idiomatic expression meaning \"to do something in a certain way\"."
    },
    {
      "time": 10.533,
      "text": "Vamos-vamos a hacerlo, hacerlo como nunca (bellaquita)",
      "translation": "Let's do it, let's do it like never before (naughty girl)",
      "grammar": "The phrase \"Vamos-vamos\" is an idiomatic expression used to emphasize the speaker's enthusiasm and eagerness, equivalent to saying \"Come on, let's go!\" in English."
    },
    {
      "time": 14.685,
      "text": "Ey, ¿qué vas a hacer hoy?, baby, vamo a vernos",
      "translation": "Hey, what are you doing today? Baby, let's see each other",
      "grammar": "The phrase \"¿qué vas a hacer\" is in the present continuous tense, used to inquire about future plans. The use of \"vamos\" instead of \"voy\" implies a shared plan or intention with the listener."
    },
    {
      "time": 19.801,
      "text": "Somos dos bellacos que nacimos pa comerno",
      "translation": "We are two scoundrels who were born to eat each other",
      "grammar": "The phrase \"nacimos pa\" is an idiomatic expression in Spanish, equivalent to the English idiom \"born to,\" indicating a natural inclination or aptitude for something."
    },
    {
      "time": 23.472,
      "text": "Cuando lo entro, ahí es que al cielo entro",
      "translation": "When I enter it, that's when I enter heaven.",
      "grammar": "The phrase \"ahí es que\" is an idiomatic expression used to indicate the moment or point in time when something happens. It can be translated as \"that's when\" and is often used to emphasize a particular event or action."
    },
    {
      "time": 28.106,
      "text": "Aquí estoy afuera, mami, pa echártela adentro",
      "translation": "Here I am outside, baby, ready to give it to you inside.",
      "grammar": "The phrase \"pa echártela\" is an idiomatic expression meaning \"ready to give it to you\" or \"prepared to deliver\", using the preposition \"pa\" (meaning \"to\" or \"for\") and the verb \"echártela\" in the infinitive form, indicating a willingness or intention."
    },
    {
      "time": 31.777,
      "text": "¿Qué vas a hacer hoy?, baby, vamo a vernos",
      "translation": "What are you doing today, baby? Let's see each other",
      "grammar": "The phrase \"¿Qué vas a hacer hoy?\" is an informal way to ask someone about their plans for the day, using the present continuous tense (vas a hacer) and the particle ¿qué, which is equivalent to \"what\" in English."
    },
    {
      "time": 36.411,
      "text": "Somos dos bellacos que nacimos pa comerno",
      "translation": "We are two scoundrels who were born to eat each other",
      "grammar": "The phrase \"nacimos pa\" is an idiomatic expression indicating the purpose or reason for something, similar to \"born to do something\". The verb \"nacimos\" is in the preterite tense, describing a past event."
    },
    {
      "time": 40.082,
      "text": "Déjalo adentro, sí, déjalo adentro",
      "translation": "Leave it inside, yes, leave it inside",
      "grammar": "The phrase \"déjalo adentro\" is an idiomatic expression that uses the verb \"dejar\" in the imperative mood to mean \"let it be\" or \"leave it alone\", rather than its literal meaning of \"to leave something somewhere\". The repetition of \"sí, déjalo adentro\" emphasizes the speaker's insistence."
    },
    {
      "time": 42.791,
      "text": "Mírame cuando chingamos, en tus ojos me pierdo",
      "translation": "Look at me when we fuck, I get lost in your eyes",
      "grammar": "The phrase \"cuando chingamos\" is an idiomatic expression translating to \"when we're having sex\" or \"when we're intimate\". The use of the present participle \"chingamos\" (we're fucking) indicates a specific moment in time, emphasizing the intensity and intimacy of the experience."
    },
    {
      "time": 46.944,
      "text": "Uh, ah, uh, sí",
      "translation": "Uh, ah, uh, yes",
      "grammar": "This interjection \"Uh, ah, uh\" is an idiomatic expression used to seek agreement or confirmation, often in informal conversations. The speaker's tone and the context determine its intended meaning."
    },
    {
      "time": 49.171,
      "text": "No la saques, papi, please",
      "translation": "Don't take it out, daddy, please",
      "grammar": "The phrase \"papi\" is an informal term of endearment used to address a father or an older man, similar to \"daddy\" in English. The use of \"papi\" adds a touch of familiarity and affection to the request."
    },
    {
      "time": 51.88,
      "text": "Estamos bien calientitos, prende el AC",
      "translation": "We're nice and warm, turn on the AC",
      "grammar": "The phrase \"estamos bien calientitos\" uses the present continuous tense to convey a sense of being in a state of warmth, emphasizing the current situation. The idiom \"calientitos\" is an informal way to express being comfortable or cozy."
    },
    {
      "time": 55.07,
      "text": "Después de venirse rico, en la puntita le doy kiss",
      "translation": "After he has a great orgasm, I give him a kiss on the tip.",
      "grammar": "The phrase \"venirse rico\" is an idiomatic expression meaning to have an intense or overwhelming experience, often used in informal contexts. It's in the past perfect tense, indicating that the event occurred before the main action of giving a kiss."
    },
    {
      "time": 60.185,
      "text": "Contando las horas pa vernos, extraño cuando le hacía los bellaqueos",
      "translation": "Counting down the hours until we see each other, I miss when I used to flirt with her",
      "grammar": "The phrase \"pa vernos\" is an idiomatic expression meaning \"until we see each other\", using the preposition \"pa\" (meaning \"until\") and the pronoun \"vernos\" (referring to seeing each other)."
    },
    {
      "time": 65.782,
      "text": "Yo solita me trasteo, pero hoy quiero sentirlo completo",
      "translation": "I move myself, but today I want to feel it completely",
      "grammar": "The phrase \"yo solita\" is an idiomatic expression meaning \"alone\" or \"by myself\", using the first person singular pronoun \"yo\" instead of the expected \"yo sola\" for emphasis."
    },
    {
      "time": 70.416,
      "text": "Ah, uh, ah, uh, sí",
      "translation": "Ah, uh, ah, uh, yes",
      "grammar": "The repeated \"ah\" and \"uh\" interjections convey hesitation or uncertainty, while the final \"sí\" (yes) indicates a sudden change in tone, from tentative to affirmative."
    },
    {
      "time": 73.124,
      "text": "I wanna fuck you, papi, you already know, ey",
      "translation": "I wanna fuck you, daddy, you already know, hey",
      "grammar": "This informal dialogue uses the present tense to express a desire or intention (\"wanna\" is a colloquialism for \"want to\"), and the phrase \"you already know\" implies shared understanding between the speaker and listener."
    },
    {
      "time": 77.758,
      "text": "Bien bellaquita le envío un mensaje de voz diciendo",
      "translation": "Okay, you little rascal, I'll send you a voice message saying",
      "grammar": "The phrase \"bellaquita\" is an affectionate and informal way to address someone, equivalent to \"little rascal\" or \"mischievous one\". The use of the diminutive suffix \"-ita\" adds a playful tone to the sentence."
    },
    {
      "time": 82.392,
      "text": "¿Qué vas a hacer hoy?, baby, vamo a vernos",
      "translation": "What are you doing today, baby? Let's see each other",
      "grammar": "The phrase \"¿Qué vas a hacer hoy?\" is an informal way to ask someone about their plans for the day, using the present continuous tense (vas a hacer) and the particle ¿qué, which is equivalent to \"what\" in English."
    },
    {
      "time": 87.026,
      "text": "Somos dos bellacos que nacimos pa comerno",
      "translation": "We are two scoundrels who were born to eat each other",
      "grammar": "The phrase \"nacimos pa\" is an idiomatic expression in Spanish, equivalent to \"born to\" or \"destined for\" in English. It indicates a natural inclination or tendency towards something, rather than a literal birth event."
    },
    {
      "time": 90.697,
      "text": "Déjalo adentro, sí, lo dejo adentro",
      "translation": "Leave it inside, yes, I'll leave it inside",
      "grammar": "The use of \"sí\" (yes) in this context is an idiomatic expression indicating strong agreement or confirmation, often used to emphasize a decision or action."
    },
    {
      "time": 93.888,
      "text": "Mírame cuando chingamos, en tus ojos me pierdo (mami, es OC, ey)",
      "translation": "Look at me when we fuck, I get lost in your eyes (mommy, it's OC, hey)",
      "grammar": "The phrase \"cuando chingamos\" is an informal idiom translating to \"when we're having sex\", using the present continuous tense to convey a sense of ongoing action."
    },
    {
      "time": 99.965,
      "text": "La pussy en la cara, las manos en las tetas",
      "translation": "Pussy in face, hands on tits",
      "grammar": "This line uses informal, colloquial language and a playful idiom to express strong emotions or reactions, with no specific grammatical focus."
    },
    {
      "time": 105.08,
      "text": "La otra mano en la boca y con los muslos me aprieta",
      "translation": "The other hand is over my mouth and she squeezes me with her thighs",
      "grammar": "This line uses the present continuous tense to describe a sudden, ongoing action, emphasizing the intensity of the situation. The phrase \"con los muslos\" is an idiomatic expression meaning \"with her thighs\", rather than a literal description."
    },
    {
      "time": 111.158,
      "text": "Que le soy interesante, el dúo del sex, flow Plan B",
      "translation": "That I'm interesting to him, the sex-flow duo Plan B",
      "grammar": "The phrase \"Que le soy\" is a colloquial way of saying \"I'm interesting to him\" in Spanish, using the present tense and the reflexive pronoun \"soy\" to express interest."
    },
    {
      "time": 116.755,
      "text": "Tú me enamoraste, yo no quería enamorarme así",
      "translation": "You made me fall in love, I didn't want to fall in love like that.",
      "grammar": "The verb phrase \"enamorarme\" is in the passive voice, indicating that the subject (yo) has had something done to them rather than taking an action. This usage emphasizes the impact of the other person's actions on the speaker."
    },
    {
      "time": 120.907,
      "text": "Acuérdame comprarte los aros nuevos de tu Mercedes, baby",
      "translation": "Remind me to buy you new rims for your Mercedes, baby",
      "grammar": "The phrase \"Acuérdame\" is an informal way of saying \"remind me\" in the present tense, using the verb \"acordar\" in its imperative form. This usage is idiomatic and common in spoken Spanish, particularly with friends or loved ones."
    },
    {
      "time": 125.541,
      "text": "Yo tengo dicho que no se lleve la Lambo",
      "translation": "I've said not to take the Lambo",
      "grammar": "This informal phrase uses the present perfect tense (yo tengo) to convey a sense of finality, emphasizing that the speaker has already made their decision. The idiomatic expression \"tengo dicho\" is equivalent to \"I've said\" in English, implying a sense of firmness and closure."
    },
    {
      "time": 130.175,
      "text": "Pa irle a comprar munchies en Golden",
      "translation": "To go buy him munchies at Golden",
      "grammar": "The phrase \"Pa irle\" is an informal way of saying \"to go and buy for him\", using the verb \"irle\" in the subjunctive mood to express a hypothetical or polite action. This construction is common in colloquial Spanish, particularly among friends or in casual conversations."
    },
    {
      "time": 133.846,
      "text": "Le envío una foto con el popo en la mano como la de Champagne Papi",
      "translation": "I'm sending you a picture with the poop in my hand, like the one in Champagne Papi.",
      "grammar": "The phrase \"como la de\" is an idiomatic expression used to compare two things, indicating that the speaker's action is similar to someone else's."
    },
    {
      "time": 141.368,
      "text": "Toy que la preño como Wheeler y Zabri",
      "translation": "Toy that I impregnated her like Wheeler and Zabri",
      "grammar": "This idiomatic expression uses the verb \"preñar\" in a figurative sense, implying a strong emotional impact rather than literal pregnancy. The sentence is in the present tense, describing a hypothetical situation."
    },
    {
      "time": 145.521,
      "text": "Lo meto, lo saco, caliente y caco",
      "translation": "I put it in, I take it out, hot and dirty",
      "grammar": "This line uses the present tense to describe a habitual action, with the verb \"meter\" and \"sacar\" repeated for emphasis. The phrase \"caliente y caco\" is an idiomatic expression meaning \"hot and dirty\", implying a sense of passion or intensity."
    },
    {
      "time": 149.192,
      "text": "Vacation, Mónaco, métele bellaco, mami",
      "translation": "Vacation, Monaco, go for it, baby",
      "grammar": "This line uses the imperative mood to convey a sense of enthusiasm and encouragement, with \"mame\" (baby) being an informal term used to address someone familiar."
    },
    {
      "time": 151.901,
      "text": "Lo meto, lo saco, caliente y caco",
      "translation": "I put it in, I take it out, hot and dirty",
      "grammar": "This line uses the present tense to describe a habitual action, with the verb forms \"meto\" and \"saco\" indicating repeated actions. The phrase \"caliente y caco\" is an idiomatic expression meaning \"hot and dirty\", emphasizing the intensity of the situation."
    },
    {
      "time": 155.572,
      "text": "Vacation, Mónaco, métele bellaco, mami",
      "translation": "Vacation, Monaco, go for it, baby",
      "grammar": "The phrase \"métele bellaco\" is an idiomatic expression that uses the verb \"meter\" in the imperative mood to encourage someone to take a risk or be reckless."
    },
    {
      "time": 158.281,
      "text": "Uh-uh-uh, ey, quítate los tacos, baby",
      "translation": "Uh-uh-uh, hey, take off your heels, baby",
      "grammar": "This line uses informal tone and colloquial expressions, with \"ey\" being an interjection equivalent to \"hey\" or \"hi\". The phrase \"quitate los tacos\" is an idiom meaning \"take off your heels\", with \"tacos\" being a common Mexican Spanish expression for high heels."
    },
    {
      "time": 162.433,
      "text": "Y pon todo ese culo a brincar",
      "translation": "And get that ass bouncing!",
      "grammar": "This line uses the informal imperative mood, with the verb \"pon\" (put) in the second person singular form \"pon\" to address someone familiar. The phrase \"culo a brincar\" is an idiomatic expression meaning \"to start moving or dancing\"."
    },
    {
      "time": 166.105,
      "text": "Métele bellaco, mete-métele bellaco, baby",
      "translation": "Put it in, you rascal, put it in, you rascal, baby",
      "grammar": "The imperative verb \"metele\" is used to give a direct order, with the repetition emphasizing urgency and playfulness. The phrase \"baby\" is an informal term of endearment, adding a touch of affection and friendliness to the tone."
    },
    {
      "time": 169.295,
      "text": "Métele bellaco, mete-métele bellaco, baby",
      "translation": "Put it in, you rascal, put it in, you rascal, baby",
      "grammar": "The phrase \"mete-métele\" is an idiomatic expression used to emphasize the imperative \"put it in\", with \"bellaco\" being a colloquial term for someone mischievous. The repetition of \"mete-métele\" creates a sense of urgency and playfulness, typical of informal spoken language."
    },
    {
      "time": 172.485,
      "text": "Métele bellaco, mete-métele bellaco, baby",
      "translation": "Put it in, you rascal, put it in, you rascal, baby",
      "grammar": "The phrase \"mete-métele\" is an idiomatic expression used to emphasize the action of putting something in, similar to \"put it in already\". The repetition of \"bellaco\" (rascal) creates a playful and informal tone."
    },
    {
      "time": 175.675,
      "text": "Métele bellaco, mete-métele bellaco, baby (pon todo ese culo a brincar)",
      "translation": "Put it in, you rascal, put it in, you rascal, baby (make that ass bounce)",
      "grammar": "The imperative verb \"metele\" is used to give an order or make a request, while the repetition of \"métale-métele\" emphasizes the urgency and playfulness of the instruction. The phrase \"pon todo ese culo a brincar\" is an idiomatic expression that means \"make it move\" or \"get it going\"."
    },
    {
      "time": 181.753,
      "text": "¿Qué vas a hacer hoy?, baby, vamo a vernos",
      "translation": "What are you doing today, baby? Let's see each other",
      "grammar": "The phrase \"¿Qué vas a hacer hoy?\" is an informal way of asking someone about their plans for the day, using the present continuous tense to convey a sense of curiosity and interest."
    },
    {
      "time": 186.387,
      "text": "Somos dos bellacos que nacimos pa comerno",
      "translation": "We are two scoundrels who were born to eat each other",
      "grammar": "The phrase \"nacimos pa\" is an idiomatic expression in Spanish, equivalent to \"born to\" or \"destined for\" in English. It's used to describe a natural inclination or tendency, rather than a literal birth event."
    },
    {
      "time": 190.058,
      "text": "Cuando lo entro, ahí es que al cielo entro",
      "translation": "When I enter it, that's when I enter heaven.",
      "grammar": "This line uses the idiomatic expression \"entro\" to convey a sense of spiritual or emotional fulfillment, rather than physical entry. The verb \"entro\" is in the present tense and implies a state of being rather than an action."
    },
    {
      "time": 194.692,
      "text": "Aquí estoy afuera, mami, pa echártela adentro",
      "translation": "Here I am outside, baby, ready to give it to you inside.",
      "grammar": "The phrase \"pa echártela\" is an informal idiom used to express willingness or readiness, similar to saying \"ready to go\" in English. The verb \"echártela\" is in the infinitive form and functions as a noun, emphasizing the speaker's preparedness."
    },
    {
      "time": 198.363,
      "text": "¿Qué vas a hacer hoy?, baby, vamo a vernos",
      "translation": "What are you doing today, baby? Let's see each other",
      "grammar": "The phrase \"¿Qué vas a hacer hoy?\" is an informal way of asking someone about their plans for the day, using the present continuous tense to convey a sense of curiosity and interest. The use of \"¿qué?\" instead of \"what\" is an idiomatic expression common in spoken Spanish."
    },
    {
      "time": 202.997,
      "text": "Somos dos bellacos que nacimos pa comerno",
      "translation": "We are two scoundrels who were born to eat each other",
      "grammar": "The phrase \"nacimos pa\" is an idiomatic expression in Spanish, equivalent to \"born to\" or \"destined for\" in English. It indicates a natural inclination or tendency towards something, often with a hint of irony or humor."
    },
    {
      "time": 206.668,
      "text": "Déjalo adentro, sí, lo dejo adentro",
      "translation": "Leave it inside, yes, I'll leave it inside",
      "grammar": "The phrase \"lo dejo adentro\" uses the present tense of the verb \"dejar\" to express a habitual or repeated action, implying that the speaker has left something inside before and will do so again."
    },
    {
      "time": 209.858,
      "text": "Mírame cuando chingamos, en tus ojos me pierdo",
      "translation": "Look at me when we fuck, I get lost in your eyes",
      "grammar": "The phrase \"cuando chingamos\" is an idiomatic expression translating to \"when we're having sex\" or \"when we're intimate\". The verb \"chingar\" has a euphemistic connotation and its tense/aspect/mood indicates a present continuous action, implying the speaker's emotional state during that moment."
    },
    {
      "time": 214.011,
      "text": "Bellaquita",
      "translation": "Little Rascal",
      "grammar": "This phrase is an idiomatic expression used to affectionately refer to someone, conveying a sense of playfulness and mischievousness. The adjective \"bellaquita\" is used in the informal register, typical of colloquial language among friends or acquaintances."
    },
    {
      "time": 215.211,
      "text": "Uh-uh-uh-uh, baby",
      "translation": "Uh-uh-uh-uh, baby",
      "grammar": "This line is an interjection, used to express strong negation or refusal. The repeated \"uh\" creates a sense of emphasis and urgency, making the phrase more forceful than simply saying \"no\"."
    },
    {
      "time": 217.92,
      "text": "Contigo me siento en las nubes",
      "translation": "With you I feel like I'm on cloud nine",
      "grammar": "The phrase \"me siento\" is an idiomatic expression indicating a subjective experience, equivalent to \"I feel like\". The verb \"siento\" is in the present tense, describing a general feeling rather than a specific event."
    },
    {
      "time": 221.11,
      "text": "Tú sigue pensando en mis nudes",
      "translation": "Keep thinking about my nudes",
      "grammar": "The phrase \"tú sigue\" is an informal command in the present continuous tense, equivalent to \"you keep on\" or \"keep going\"."
    }
  ]
}