{
  "id": "es_yogurcito",
  "title": "YOGURCITO",
  "artist": "Blessd",
  "level": "B2 (Upper Intermediate)",
  "from_language": "es",
  "to_language": "en",
  "audio": "/audio/es_yogurcito.mp3",
  "duration": 184,
  "licensing_note": "Lyrics fetched via Musixmatch API; translations via local Ollama.",
  "lines": [
    {
      "time": 0.0,
      "text": "Uy",
      "translation": "Oh",
      "grammar": "This interjection \"Uy\" is an informal expression of surprise or excitement, equivalent to the more formal \"Oh\"."
    },
    {
      "time": 3.994199999988079,
      "text": "Escuche pues",
      "translation": "Listen then",
      "grammar": "The phrase \"Escuche pues\" is an imperative sentence in the present tense, with a hint of politeness conveyed by the adverb \"pues\", which can be translated as \"then\" or \"so\"."
    },
    {
      "time": 5.653799999982119,
      "text": "The Prodigiez",
      "translation": "The Prodigies",
      "grammar": "This phrase is an interjection, used to express surprise or admiration, and remains in the present tense."
    },
    {
      "time": 8.203399999976158,
      "text": "Yo no me conformo a verte por las foto' (ey)",
      "translation": "I'm not satisfied with just seeing you in photos (hey)",
      "grammar": "The phrase \"Yo no me conformo\" is an idiomatic expression that conveys the speaker's dissatisfaction, using the present tense to emphasize their ongoing feelings. The use of \"no\" and \"me\" agrees with the subject-verb agreement rules in Spanish."
    },
    {
      "time": 11.232799999982118,
      "text": "Mándame la ubi para yo llegarle",
      "translation": "Send me the location so I can get there",
      "grammar": "The phrase \"yo llegarle\" is an idiomatic expression, where \"yo\" is a pronoun used to emphasize the speaker's intention, and \"llegarle\" is a reflexive verb in the infinitive form, indicating the speaker's desire to reach someone or something."
    },
    {
      "time": 14.523899999976159,
      "text": "En el cuarto, baby, vamo' a hace' una porno",
      "translation": "In the room, baby, let's make a porno",
      "grammar": "The phrase \"vamo' a\" is an informal way of saying \"let's go\" or \"we're going to\", using the verb \"ir\" in the future tense and the particle \"a\"."
    },
    {
      "time": 17.81279999998212,
      "text": "Te jalo del pelo, no vas a quitarte",
      "translation": "I'll pull your hair, you're not going to let go",
      "grammar": "The phrase \"Te jalo\" is an informal way of saying \"I'll grab you\" or \"I'll get hold of you\", using the verb \"jalar\" in the future tense and the pronoun \"te\" (direct object) to convey a sense of playful teasing."
    },
    {
      "time": 21.28569999998808,
      "text": "¿Qué es lo que tiene ese booty tuyo, mami?",
      "translation": "What is it about your booty, mami?",
      "grammar": "This line uses the present tense to ask a rhetorical question, and the phrase \"¿Qué es lo que...\" is an idiomatic way of saying \"what's so special\" or \"what's going on\". The use of \"tuyo\" (your) agrees with \"booty\", emphasizing possession."
    },
    {
      "time": 24.76669999998808,
      "text": "Que me haces pensarte cuando yo estoy solo",
      "translation": "You make me think of you when I'm alone.",
      "grammar": "The phrase \"¿Qué me haces?\" is an idiomatic expression that translates to \"What do you make me\" or \"How do you make me feel\". The use of the verb \"hacer\" in this context implies a causative relationship, conveying the idea that someone's actions or presence have a specific effect on the speaker."
    },
    {
      "time": 29.059599999994038,
      "text": "Lo más hijueputa es cuando te hago venir",
      "translation": "The worst thing is when I make you come",
      "grammar": "This line uses the informal second-person singular pronoun \"te\" and the colloquial expression \"hijueputa\" to convey strong emotions, emphasizing the speaker's frustration. The sentence is in the present tense, describing a habitual or repeated action."
    },
    {
      "time": 31.41840000000596,
      "text": "Y me dices: \"papi, no quiero con otro\"",
      "translation": "And you tell me: \"Daddy, I don't want to be with anyone else\"",
      "grammar": "The use of \"papi\" as a term of endearment is an informal idiom in Spanish, equivalent to \"honey\" or \"sweetheart\", conveying affection and familiarity."
    },
    {
      "time": 34.09840000000596,
      "text": "Rico, adicto a tu toto",
      "translation": "Rich, addicted to your pussy",
      "grammar": "The phrase \"adicto a\" is an idiomatic expression indicating addiction or strong attachment, using the present participle of the verb \"ser\" (to be) in the passive voice."
    },
    {
      "time": 36.24429999998212,
      "text": "Me quitas las prenda', yo te lo coloco",
      "translation": "You take off my clothes, I'll put them on you",
      "grammar": "The phrase \"Me quitas\" is an idiomatic expression meaning \"you take off\", using the informal \"tú\" form and the verb \"quitar\" in the second person singular."
    },
    {
      "time": 40.25240000000596,
      "text": "Le gusta lo caro, se moja si la toco",
      "translation": "She likes expensive things, she gets wet if I touch her.",
      "grammar": "The phrase \"se moja\" is an idiomatic expression indicating a strong emotional reaction, equivalent to saying \"she gets upset\" or \"she becomes emotional\". The verb \"mojar\" typically means \"to get wet\", but in this context it's used figuratively to convey the idea of being overcome with emotion."
    },
    {
      "time": 43.56569999998808,
      "text": "Se baja los panty y me mandó una foto",
      "translation": "She pulled down her panties and sent me a picture",
      "grammar": "The use of \"se baja\" is an informal idiom, equivalent to \"to take off\" or \"to remove\", in the present tense, indicating a sudden action."
    },
    {
      "time": 47.03929999998212,
      "text": "En la mano el AP, mueve todo eso pa mí",
      "translation": "In my hand, AP, move all that for me",
      "grammar": "The phrase \"pa mí\" is an idiomatic expression meaning \"for me\" or \"to me\", used to indicate the speaker's personal involvement in a situation."
    },
    {
      "time": 50.80659999999404,
      "text": "Dice que nadie le ha dao así como yo le di",
      "translation": "He says that nobody has ever treated him like I did.",
      "grammar": "The phrase \"como yo le di\" is an idiomatic expression indicating a strong comparison, equivalent to \"in the same way that I did it\". The verb \"di\" is in the past perfect tense, emphasizing the completeness of the action."
    },
    {
      "time": 54.149900000005964,
      "text": "Yo hago que te conviertas en diabla, palabras sobran",
      "translation": "I'll turn you into a devil, words fail me",
      "grammar": "The phrase \"Yo hago\" is an informal way of saying \"I'll\" in Spanish, using the first person singular verb form to express a future action. This idiomatic expression is commonly used in spoken language and informal writing."
    },
    {
      "time": 62.19140000000596,
      "text": "Porque en la cama no se habla, partimos tabla",
      "translation": "Because we don't talk in bed, we're done.",
      "grammar": "The phrase \"no se habla\" is an idiomatic expression meaning \"we don't talk\", rather than a literal description of the situation. This usage note highlights the informal tone and colloquial language used in the original Spanish lyrics."
    },
    {
      "time": 64.593,
      "text": "En la cama arreglamo' siempre que discutimo'",
      "translation": "We always make up in bed when we argue.",
      "grammar": "The phrase \"arreglamo'\" is an informal, idiomatic expression meaning \"to make up\" or \"to reconcile\", often used to describe a common pattern of behavior. The use of the verb \"arreglar\" (meaning \"to fix\" or \"to settle\") in this context implies a sense of resolving conflicts and restoring harmony."
    },
    {
      "time": 64.593,
      "text": "Son más de siete polvo' y siempre nos venimo'",
      "translation": "It's more than seven times, and we always come.",
      "grammar": "The phrase \"son más de\" is an idiomatic expression meaning \"it's more than\", using the verb \"ser\" in the present tense to convey a habitual or general truth."
    },
    {
      "time": 67.79459999999403,
      "text": "Me pide que no pare, que le dé más castigo",
      "translation": "He asks me not to stop, to punish him further.",
      "grammar": "The phrase \"que no pare\" is an imperative sentence in the present tense, used to express a request or command. The pronoun \"le\" agrees with the masculine subject \"él\"."
    },
    {
      "time": 71.09819999998808,
      "text": "Esta ninfomaniaca me tiene envuelto en su nido",
      "translation": "This nymphomaniac has me wrapped up in her nest",
      "grammar": "The phrase \"esta ninfomaniaca\" is an idiomatic expression, equivalent to saying \"this woman is a nymphomaniac\". The verb \"tener\" is in the present tense, indicating a current state of being wrapped up."
    },
    {
      "time": 74.49509999999404,
      "text": "Yo no me conformo a verte por las foto' (ey)",
      "translation": "I'm not satisfied with just seeing you in photos (hey)",
      "grammar": "The phrase \"Yo no me conformo\" is an idiomatic expression indicating refusal or unwillingness, using the present tense to convey a sense of ongoing dissatisfaction."
    },
    {
      "time": 78.7235,
      "text": "Mándame la ubi para yo llegarle",
      "translation": "Send me the location so I can get there",
      "grammar": "The phrase \"yo llegarle\" is an idiomatic expression, where \"yo\" is a pronoun used to indicate the speaker's intention or purpose, and \"llegarle\" means \"to arrive at someone\" rather than \"to arrive somewhere\"."
    },
    {
      "time": 82.10659999999405,
      "text": "En el cuarto, baby, vamo' a hace' una porno",
      "translation": "In the room, baby, let's make a porno",
      "grammar": "The phrase \"vamo' a\" is an informal way of saying \"let's\" in Spanish, using the verb \"ir\" (to go) in the future tense and the pronoun \"a\" to indicate direction. This idiomatic expression is often used in casual conversations among friends."
    },
    {
      "time": 85.34809999999403,
      "text": "Te jalo del pelo, no vas a quitarte",
      "translation": "I'll pull your hair, you're not going to let go",
      "grammar": "This line uses the informal second-person singular verb form \"vas\" and the imperative mood to convey a sense of familiarity and urgency, characteristic of colloquial Spanish. The phrase \"Te jalo del pelo\" is an idiomatic expression meaning \"to pull someone's leg\" or tease them playfully."
    },
    {
      "time": 88.88819999998807,
      "text": "¿Qué es lo que tiene ese booty tuyo, mami?",
      "translation": "What is it about your booty, mami?",
      "grammar": "The phrase \"¿Qué es lo que\" is an idiomatic expression used to ask for clarification or details, equivalent to \"what's the story with\" in English. The use of \"tuyo\" (your) agrees with the possessive pronoun \"mami\", emphasizing a personal and intimate tone."
    },
    {
      "time": 92.28290000000597,
      "text": "Que me haces pensarte cuando yo estoy solo",
      "translation": "You make me think of you when I'm alone.",
      "grammar": "The phrase \"que me haces\" is an idiomatic expression equivalent to \"you make me\" in English, using the subjunctive mood to convey a subjective impression. The pronoun \"me\" agrees with the subject \"yo\" in number and person."
    },
    {
      "time": 95.618,
      "text": "Lo más hijueputa es cuando te hago venir",
      "translation": "The worst thing is when I make you come",
      "grammar": "This line uses the informal second-person singular verb form \"te\" and the colloquial expression \"hijueputa\" to convey strong emotions, emphasizing the speaker's frustration. The sentence is in the present tense, with a sense of immediacy and urgency."
    },
    {
      "time": 99.0065,
      "text": "Y me dices: \"papi, no quiero con otro\"",
      "translation": "And you tell me: \"Daddy, I don't want to be with anyone else\"",
      "grammar": "The phrase \"papi\" is an informal term used to address a father or an older man, and the sentence uses the present tense to convey a sense of urgency and intimacy."
    },
    {
      "time": 102.13279999998211,
      "text": "Usted tranquila, reina, que yo conduzco",
      "translation": "Don't worry, queen, I'll drive.",
      "grammar": "The phrase \"yo conduzco\" is in the present tense and implies a sense of responsibility or obligation, similar to the English idiom \"I've got this\"."
    },
    {
      "time": 104.98679999998213,
      "text": "Yo me pongo tierno, pero también yo soy brusco",
      "translation": "I can be tender, but I can also be brusque.",
      "grammar": "This line uses the present tense to describe the speaker's ability to switch between two contrasting personalities, with \"yo\" emphasizing the speaker's personal experience. The phrase \"Yo me pongo tierno\" is an idiomatic expression meaning \"I become tender\", rather than a literal description of physical transformation."
    },
    {
      "time": 108.25259999999403,
      "text": "Dígame, mujer, que a escondidas la seduzco",
      "translation": "Tell me, woman, I secretly seduce you",
      "grammar": "The verb \"seduzco\" is in the present tense and has an idiomatic meaning of \"to seduce someone\", rather than its literal translation. The use of \"a escondidas\" (secretly) emphasizes the private nature of the action."
    },
    {
      "time": 111.64519999998808,
      "text": "Deme un polvito y verá que yo me luzco",
      "translation": "Give me a little powder and you'll see I shine",
      "grammar": "The phrase \"me luzco\" is an idiomatic expression meaning \"I'm at my best\" or \"I'm in top form\", using the verb luzco in the first person singular, which is a colloquial way to express confidence or pride."
    },
    {
      "time": 115.07579999998212,
      "text": "El yogurcito ya está listo allá, en la barbería (ja, ja)",
      "translation": "The yogurt is ready there at the barbershop (ha, ha)",
      "grammar": "In this line, the verb \"está\" is in the present continuous tense, indicating that the action of being ready has started and continues up to the moment of speaking. The phrase \"ya está listo\" can be translated as \"it's already ready\", emphasizing the completion of the action."
    },
    {
      "time": 118.40859999999404,
      "text": "Empezamos en la noche y terminamos en el día (sabes)",
      "translation": "We started at night and finished during the day (you know)",
      "grammar": "The phrase \"sabes\" is an informal way of saying \"you know\", using the second person singular pronoun to create a sense of intimacy and shared experience."
    },
    {
      "time": 121.78079999998212,
      "text": "Estoy listo pa darle candela, pero a escondida'",
      "translation": "I'm ready to set things on fire, but secretly.",
      "grammar": "The phrase \"pa darle\" is an informal idiom used in some Latin American countries, equivalent to \"to give it their all\" or \"to go all out\", and is often used in a colloquial or playful tone."
    },
    {
      "time": 125.19069999998808,
      "text": "Ay, mi vida, ay, mi vida",
      "translation": "Oh, my life, oh, my life",
      "grammar": "This interjection \"ay\" is an expression of emphasis or strong feeling, often used to draw attention or convey enthusiasm. The repeated phrase \"mi vida\" (my life) emphasizes the speaker's emotional investment in their life."
    },
    {
      "time": 128.6121999999881,
      "text": "Qué rico, qué rico, qué rico ese totito",
      "translation": "How delicious, how delicious, how delicious that little pussy is!",
      "grammar": "This line uses the adverb \"qué\" to emphasize the adjective \"rico\", creating an idiomatic expression. The sentence also employs the present tense and the pronoun \"ese\" to refer to a specific totito."
    },
    {
      "time": 134.19509999999403,
      "text": "Más cuando está mojado, mi amor, por los besito'",
      "translation": "Especially when it's wet, my love, because of the little kisses.",
      "grammar": "The phrase \"por los besito'\" is an idiomatic expression meaning \"because of the little kisses\", using the diminutive form \"besito\" to convey affection."
    },
    {
      "time": 135.37959999999404,
      "text": "Qué rico, qué rico, te juro, mi amorcito",
      "translation": "Oh, how delicious, how delicious, I swear, my darling",
      "grammar": "The phrase \"qué rico\" is an idiomatic expression used to emphasize the deliciousness of food, using the present tense and a superlative form to convey strong enthusiasm."
    },
    {
      "time": 138.69969999998807,
      "text": "Acérquese despacio, yo le meto un dedito",
      "translation": "Come closer slowly, I'll put a finger in.",
      "grammar": "The phrase \"Acérquese\" is an imperative verb form in the second person singular, instructing someone to come closer. The use of \"despacio\" (slowly) modifies the action, indicating the manner in which the speaker wants the person to approach."
    },
    {
      "time": 142.0912999999821,
      "text": "Ja, ja",
      "translation": "Ha ha",
      "grammar": "This interjection \"Ja, ja\" is an informal way to express laughter or amusement in German, similar to the English phrase \"Ha ha\"."
    },
    {
      "time": 143.64090000000596,
      "text": "Ave María, mi amor (ja, ja)",
      "translation": "Hail Mary, my love (ha, ha)",
      "grammar": "The phrase \"mi amor\" is an idiomatic expression meaning \"my love\", and the use of \"amor\" instead of a more formal title or possessive adjective (\"my\") emphasizes the speaker's affection."
    },
    {
      "time": 144.7007999999821,
      "text": "Aquí no sé qué decirle, venga, fluya (ja, ja)",
      "translation": "I don't know what to tell you here, come on, just go with the flow (ha, ha)",
      "grammar": "The phrase \"venga\" is an informal imperative verb form, equivalent to \"come on\", used to encourage someone to take action."
    },
    {
      "time": 147.45840000000595,
      "text": "Me hace el amor bien rico, mi reina, que",
      "translation": "He makes love to me so good, my queen, that",
      "grammar": "The phrase \"hace el amor\" is an idiomatic expression meaning \"to make love\" or \"to have a romantic relationship\". The verb \"hacer\" is in the present tense and imperfective aspect, indicating ongoing action."
    },
    {
      "time": 150.44469999998807,
      "text": "Usted sabe, en la cama, ¿pa qué hablar?",
      "translation": "You know, in bed, what's the point of talking?",
      "grammar": "The phrase \"¿Pa qué hablar?\" is an idiomatic expression that translates to \"what's the point of\" or \"why bother\", conveying a sense of futility. The use of the verb \"hablar\" (to speak) in the present continuous tense (\"pa qué hablar\") emphasizes the speaker's frustration with pointless conversation."
    },
    {
      "time": 152.64769999998808,
      "text": "Las palabras sobran, ¿vamo'?",
      "translation": "Words are unnecessary, shall we?",
      "grammar": "The phrase \"¿Vamo'?\" is an informal way to ask someone if they want to do something, using the vosotros pronoun and the verb ir in the informal command form."
    },
    {
      "time": 155.46809999999405,
      "text": "Siempre Blessd",
      "translation": "Always Blessed",
      "grammar": "This phrase uses the present participle \"Blessed\" to convey a sense of continuous or habitual blessing, rather than a one-time event. The use of \"Siempre\" (always) emphasizes this ongoing state."
    },
    {
      "time": 158.55540000000596,
      "text": "Y esto es pa ti, tú sabes quién",
      "translation": "And this is for you, you know who.",
      "grammar": "The phrase \"esto es pa ti\" uses the informal \"tú\" form of address and the idiomatic expression \"pa ti\" to convey a sense of intimacy and directness, emphasizing that the speaker's words are intended specifically for the listener."
    },
    {
      "time": 161.72840000000596,
      "text": "Dímelo, Jara",
      "translation": "Tell me, Jara",
      "grammar": "This line is an imperative sentence in the present tense, using the informal command form \"dímelo\" to address someone familiar. The phrase \"Dímelo, Jara\" is a common idiomatic expression used to ask someone for information or clarification."
    },
    {
      "time": 164.40490000000597,
      "text": "The-The Prodigiez",
      "translation": "The Prodigies",
      "grammar": "This line illustrates the use of an idiomatic title, where \"The-The\" is a phonetic representation of the original Spanish phrase \"Los-los\", emphasizing the plural noun \"Prodigies\"."
    },
    {
      "time": 165.3621999999881,
      "text": "Junto a El Bendito",
      "translation": "Next to El Bendito",
      "grammar": "This phrase uses the preposition \"junto a\" to indicate proximity, which is an idiomatic expression in Spanish. It can be translated as \"next to\" or \"beside\"."
    },
    {
      "time": 166.73919999998807,
      "text": "Mi amor, usted sabe, en cualquier puto ritmito",
      "translation": "My love, you know, to any fucking rhythm",
      "grammar": "The phrase \"en cualquier puto ritmo\" is an idiomatic expression using the adjective \"puto\" (literally meaning \"cunt\") to emphasize the idea of something being true regardless of the circumstances. The use of this strong language adds a tone of informality and playfulness in the lyrics."
    }
  ]
}