{
  "id": "fr_33_max_verstappen",
  "title": "33 Max Verstappen",
  "artist": "Carte Blanq feat. Maxx Power",
  "level": "B2 (Upper Intermediate)",
  "from_language": "fr",
  "to_language": "en",
  "audio": "/audio/fr_33_max_verstappen.mp3",
  "duration": 170,
  "licensing_note": "Lyrics fetched via Musixmatch API; translations via local Ollama.",
  "lines": [
    {
      "time": 0.0,
      "text": "Hey (hey, oh)",
      "translation": "Hey (hey, oh)",
      "grammar": "This interjection uses a familiarization technique called \"echo\" to create a sense of intimacy and informality, emphasizing the speaker's friendly tone. The repeated \"hey\" also functions as an attention-grabber, drawing the listener in."
    },
    {
      "time": 3.234,
      "text": "(Hey, oh) hey",
      "translation": "(Hey, oh) hey",
      "grammar": "This interjection is an informal way to get someone's attention or express enthusiasm, using a repetitive and emphatic tone. The use of \"hey\" twice adds a sense of urgency and playfulness."
    },
    {
      "time": 6.468,
      "text": "Tu-tu-du-du, Max Verstappen",
      "translation": "You-you-du-du-du, Max Verstappen",
      "grammar": "This line is an example of a playful use of onomatopoeia to create a catchy and memorable phrase. The repetition of \"tu-tu\" mimics the sound of a drumbeat, drawing attention to the name \"Max Verstappen\"."
    },
    {
      "time": 12.637,
      "text": "Tu-tu-du-du, Max Verstappen",
      "translation": "You-you-du-du-du, Max Verstappen",
      "grammar": "This line is an example of onomatopoeia, where the repeated \"tu-tu\" and \"du-du\" mimic the sounds of a drumbeat, creating a catchy and memorable phrase. The use of the name \"Max Verstappen\" adds a playful touch, as it's unlikely to be referring to the actual Formula One driver."
    },
    {
      "time": 18.805,
      "text": "Tu-tu-du-du, Max Verstappen",
      "translation": "You-you-du-du-du, Max Verstappen",
      "grammar": "This line uses the onomatopoeic phrase \"Tu-tu-du-du\" to imitate the sound of a song or jingle, rather than conveying a specific meaning. The name \"Max Verstappen\" is likely used as an example or reference point, rather than being part of the lyrical content itself."
    },
    {
      "time": 24.973,
      "text": "Tu-tu-du-du, Max Verstappen",
      "translation": "You-you-du-du-du, Max Verstappen",
      "grammar": "This line is an interjection, used to express excitement or enthusiasm. The repetition of \"tu\" and \"du\" creates a playful, rhythmic effect, similar to the English phrase \"Hey-hey-ho-ho\"."
    },
    {
      "time": 31.141,
      "text": "Let's shake it to the max",
      "translation": "Let's shake it to the max",
      "grammar": "This idiomatic expression uses the present tense and imperative mood to convey a sense of enthusiasm and encouragement, urging someone to fully engage in an activity. The phrase \"shake it\" is an idiom that means to enjoy oneself or have fun."
    },
    {
      "time": 38.288,
      "text": "Put your hands up, hands up",
      "translation": "Put your hands up, hands up",
      "grammar": "This imperative phrase uses the present tense to convey a sense of urgency and encourages immediate action. The repeated \"hands up\" idiom emphasizes the importance of compliance."
    },
    {
      "time": 44.456,
      "text": "Take it to the max",
      "translation": "Take it to the max",
      "grammar": "This idiomatic expression uses the present continuous tense to convey a sense of enthusiasm and encouragement, urging someone to push themselves to their limits."
    },
    {
      "time": 49.646,
      "text": "Put your hands up, hands up",
      "translation": "Put your hands up, hands up",
      "grammar": "This imperative sentence uses the present tense to convey a sense of urgency and encourages immediate action. The idiom \"put your hands up\" is an English expression used in various contexts, including music performances and competitions."
    },
    {
      "time": 55.815,
      "text": "Let's go, let's go",
      "translation": "Let's go, let's go",
      "grammar": "This line uses the present imperative mood to express a suggestion or invitation, with the idiomatic phrase \"let's go\" conveying a sense of shared action."
    },
    {
      "time": 61.983,
      "text": "Let's go, let's go",
      "translation": "Let's go, let's go",
      "grammar": "This is an imperative sentence in the present tense, using the first person plural pronoun \"let's\" to express a suggestion or invitation."
    },
    {
      "time": 68.151,
      "text": "Let's go (go, go, go, go)",
      "translation": "Let's go (go, go, go, go)",
      "grammar": "This line exemplifies the use of the imperative mood in English, urging someone to take action. The repetition of \"go\" emphasizes enthusiasm and eagerness."
    },
    {
      "time": 75.298,
      "text": "Max Verstappen",
      "translation": "Max Verstappen",
      "grammar": "This proper noun phrase is a direct reference to the person Max Verstappen, using his full name in its original form."
    },
    {
      "time": 77.554,
      "text": "Tu-tu-du-du, Max Verstappen",
      "translation": "You-you-du-du-du, Max Verstappen",
      "grammar": "This line is an example of a playful, informal idiom used to express enthusiasm or excitement, with the repetition of \"tu-tu\" creating a catchy rhythm. The use of the name \"Max Verstappen\" adds humor and whimsy to the phrase."
    },
    {
      "time": 83.722,
      "text": "Tu-tu-du-du, Max Verstappen (hey)",
      "translation": "Tu-du-du-du, Max Verstappen (hey)",
      "grammar": "This line is an example of a playful, informal greeting in English, using the idiomatic phrase \"Tu-tu-du-du\" to mimic the sound of a song or jingle. The use of \"(hey)\" at the end adds a casual tone and invites interaction."
    },
    {
      "time": 90.868,
      "text": "Tu-tu-du-du, Max Verstappen",
      "translation": "You-you-du-du-du, Max Verstappen",
      "grammar": "This line is an example of onomatopoeia, where the repeated \"tu-tu\" and \"du-du\" mimic the sound of a drumbeat or music, rather than conveying specific meaning. The phrase is also an interjection, used to express excitement or energy."
    },
    {
      "time": 97.037,
      "text": "Tu-tu-du-du, Max Verstappen (hey)",
      "translation": "Tu-du-du-du, Max Verstappen (hey)",
      "grammar": "This line uses a playful, informal tone and incorporates an idiomatic expression (\"Tu-tu-du-du\") to grab attention, similar to saying \"Hey, listen up!\" in English. The phrase is likely used as an interjection to express excitement or enthusiasm."
    },
    {
      "time": 104.183,
      "text": "That's how we do it",
      "translation": "That's how we do it",
      "grammar": "This phrase is an idiomatic expression, using the present simple tense to convey a habitual or general truth about the speaker's actions. The pronoun \"we\" agrees with the subject-verb agreement in English."
    },
    {
      "time": 110.351,
      "text": "Simply, simply, lovely",
      "translation": "Simply, simply, lovingly",
      "grammar": "The repeated use of \"simply\" emphasizes the speaker's sincerity and strong emotions, while the phrase as a whole conveys affectionate enthusiasm."
    },
    {
      "time": 113.585,
      "text": "Yes, whoo",
      "translation": "Yes, whoo",
      "grammar": "This interjection \"whoo\" is an expression of excitement or enthusiasm, often used to emphasize a point or show agreement. It can be translated as \"yes\" in this context, conveying a sense of confirmation and approval."
    },
    {
      "time": 115.841,
      "text": "(Yeah, here we go again)",
      "translation": "(Yeah, here we go again)",
      "grammar": "This idiomatic expression is an interjection, used to express enthusiasm or anticipation, and remains in the present tense, mirroring the speaker's emotional state. The phrase is often used to introduce a new experience or situation, implying that it will be similar to previous ones."
    },
    {
      "time": 121.032,
      "text": "(Oh my Lord, Max)",
      "translation": "(Oh my Lord, Max)",
      "grammar": "This interjection uses the idiomatic expression \"Oh my Lord\" to convey strong surprise or emphasis, with no specific tense or aspect implied."
    },
    {
      "time": 125.244,
      "text": "Yes, yes",
      "translation": "Yes, yes",
      "grammar": "This interjection \"yes\" is used to express strong agreement or confirmation, often with rising intonation to seek further confirmation."
    },
    {
      "time": 127.5,
      "text": "Oh my God",
      "translation": "Oh, my God.",
      "grammar": "This interjection is an informal way to express strong surprise or shock, with no grammatical implications."
    },
    {
      "time": 130.734,
      "text": "Whoa",
      "translation": "Whoa",
      "grammar": "This interjection is an informal expression of surprise or excitement, often used in spoken English. Its tone and emphasis convey a sense of sudden realization or astonishment."
    },
    {
      "time": 132.012,
      "text": "Yes (Max Verstappen)",
      "translation": "Yes (Max Verstappen)",
      "grammar": "This line is an example of a direct quote or citation, where the speaker's voice is imitated by using parentheses to set off the name."
    },
    {
      "time": 135.246,
      "text": "(You are the World Champion)",
      "translation": "(You are the World Champion)",
      "grammar": "This line is an example of a direct address, where the speaker addresses someone directly using the pronoun \"you\", emphasizing their importance and achievement. The sentence is in the present tense, stating a fact about the person's status as World Champion."
    },
    {
      "time": 140.437,
      "text": "(The World Champion)",
      "translation": "(The World Champion)",
      "grammar": "This phrase is an interjection, used to emphasize or introduce a topic, and remains in the present tense."
    },
    {
      "time": 143.671,
      "text": "Tu-tu-du-du, Max Verstappen",
      "translation": "You-you-du-du-du, Max Verstappen",
      "grammar": "This line is an example of a playful use of onomatopoeia, mimicking the sound of a catchy tune, and also referencing the name of a famous Formula One driver, Max Verstappen."
    },
    {
      "time": 149.839,
      "text": "Tu-tu-du-du, Max Verstappen (hey)",
      "translation": "Tu-du-du-du, Max Verstappen (hey)",
      "grammar": "This line uses a playful, informal tone and features an idiomatic expression (\"Tu-tu-du-du\") that is likely meant to be catchy and memorable. The phrase \"Max Verstappen\" is used as a proper noun, rather than being replaced with a pronoun or description."
    },
    {
      "time": 156.985,
      "text": "Tu-tu-du-du, Max Verstappen",
      "translation": "You-you-du-du-du, Max Verstappen",
      "grammar": "This line is an example of a playful idiom, using onomatopoeic words (\"tu-tu-du-du\") to create a catchy rhythm. The name \"Max Verstappen\" is likely used as a reference point or cultural nod rather than being grammatically significant."
    },
    {
      "time": 163.154,
      "text": "Tu-tu-du-du, Max Verstappen (hey)",
      "translation": "Tu-du-du-du, Max Verstappen (hey)",
      "grammar": "The phrase \"Tu-tu-du-du\" is an onomatopoeic expression, mimicking the sound of a repetitive drumbeat or rhythm."
    }
  ]
}