{
  "id": "fr_alors_on_danse_mowgli_remix",
  "title": "Alors on danse (Mowgli Remix)",
  "artist": "Stromae",
  "level": "B2 (Upper Intermediate)",
  "from_language": "fr",
  "to_language": "en",
  "audio": "/audio/fr_alors_on_danse_mowgli_remix.mp3",
  "duration": 391,
  "licensing_note": "Lyrics fetched via Musixmatch API; translations via local Ollama.",
  "lines": [
    {
      "time": 0.0,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to express a habitual or general truth, rather than describing an actual action happening at a specific time."
    },
    {
      "time": 4.147,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to convey a sense of habitual or general truth, rather than describing a specific action. The phrase \"on danse\" is an informal way to say \"we're dancing\" in English, emphasizing the shared experience and camaraderie."
    },
    {
      "time": 8.293,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "The phrase \"Alors on danse\" is an idiomatic expression that combines a conjunction (alors) with a verb (danse), conveying the idea of simultaneous action, equivalent to \"And then we start dancing\"."
    },
    {
      "time": 12.44,
      "text": "Qui dit étude dit travail,",
      "translation": "Studying means working.",
      "grammar": "This idiomatic expression uses the present tense to convey a general truth, rather than describing a specific action. The phrase is equivalent to saying \"studying implies or involves working\"."
    },
    {
      "time": 19.08,
      "text": "Qui dit taf te dit les thunes,",
      "translation": "Work means money.",
      "grammar": "This idiomatic expression uses the present tense to convey a general truth, rather than describing a specific event. The phrase \"qui dit\" is an equivalent of \"who says\", emphasizing that work and earning money are often linked in people's minds."
    },
    {
      "time": 28.212,
      "text": "Qui dit argent dit dépenses,",
      "translation": "Money means expenses.",
      "grammar": "This idiomatic expression uses the present tense to convey a general truth, and the phrase \"dit\" is an impersonal construction equivalent to \"it's said that\"."
    },
    {
      "time": 34.852,
      "text": "Et qui dit crédit dit créance,",
      "translation": "And where there is credit, there is a debt.",
      "grammar": "This idiomatic expression uses the present tense to convey a general truth about the relationship between credit and debt. The phrase \"dit\" is used in its figurative sense, meaning \"implies\" or \"suggests\", rather than its literal sense of \"says\"."
    },
    {
      "time": 42.738,
      "text": "Qui dit dette te dit huissier,",
      "translation": "Debt means bailiff.",
      "grammar": "This idiomatic expression uses the present tense to convey a general truth, rather than describing a specific situation. The phrase is an example of a French proverbial saying that equates debt with being pursued by a bailiff."
    },
    {
      "time": 50.624,
      "text": "Et lui dit assis dans la merde.",
      "translation": "And he said, sitting in the shit.",
      "grammar": "This informal expression uses the idiomatic phrase \"assis dans la merde\" to convey being in a difficult or unpleasant situation, equivalent to saying \"up to one's neck in trouble\". The sentence is written in the present tense and employs colloquial language."
    },
    {
      "time": 59.757,
      "text": "Qui dit Amour dit les gosses,",
      "translation": "Love and children go hand in hand.",
      "grammar": "The phrase \"Qui dit Amour dit les gosses\" is an idiomatic expression, where the verb \"dit\" (says) is in the present tense, indicating a general truth or a common saying."
    },
    {
      "time": 67.643,
      "text": "Dit toujours et dit divorce.",
      "translation": "Always say it, and it means divorce.",
      "grammar": "This idiomatic expression uses the present tense to convey a habitual or general truth about saying something that has consequences. The phrase \"dit toujours\" implies a consistent pattern of speaking that ultimately leads to separation."
    },
    {
      "time": 74.283,
      "text": "Qui dit proches te dis deuils car les problèmes ne viennent pas seul.",
      "translation": "When you're close to someone, you're also grieving, because problems never come alone.",
      "grammar": "This idiomatic expression uses the present tense to convey a general truth about human experience. The phrase \"Qui dit proches te dis deuils\" is an example of a French proverbial saying that highlights the connection between proximity and shared suffering."
    },
    {
      "time": 90.894,
      "text": "Qui dit crise te dis monde dit famine dit tiers-monde.",
      "translation": "Crisis means world, famine means third world.",
      "grammar": "This idiomatic expression uses the present tense to describe a situation, employing a metaphorical comparison between crisis and world, famine and third world. The phrase is an example of synecdoche, where a part (crise) represents the whole (monde), emphasizing the perceived global impact of these issues."
    },
    {
      "time": 105.013,
      "text": "Qui dit fatigue dit réveille encore sourd de la veille,",
      "translation": "Being tired means waking up still deaf from the night before.",
      "grammar": "This idiomatic expression uses the present tense to convey a general truth about being tired, rather than describing a specific situation. The phrase \"dit réveille\" is an example of a French idiom that doesn't have a direct English equivalent."
    },
    {
      "time": 117.885,
      "text": "Alors on sort pour oublier tous les problèmes.",
      "translation": "So we go out to forget all our problems.",
      "grammar": "The phrase \"on sort\" is an idiomatic expression meaning \"to go out\" or \"to leave\", using the impersonal pronoun \"on\" and the verb \"sortir\" in the present tense, indicating a habitual or general action."
    },
    {
      "time": 128.264,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "The phrase \"Alors on danse\" is an idiomatic expression, using the adverbial conjunction \"alors\" to indicate a sudden change or transition, followed by the verb \"danse\" in the present tense, implying a habitual or ongoing action."
    },
    {
      "time": 132.411,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "The phrase \"Alors on danse\" is an idiomatic expression that combines a conjunction (\"Alors\") with a verb in the third person plural (\"on danse\"), conveying a sense of shared action or collective movement."
    },
    {
      "time": 136.558,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to convey a sense of habitual or general truth, rather than describing a specific action. The pronoun \"on\" is an informal, second-person plural form equivalent to \"you guys\"."
    },
    {
      "time": 140.704,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "The phrase \"Alors on danse\" is an idiomatic expression that uses the present tense to convey a sense of habitual or general truth, rather than describing a specific action. The pronoun \"on\" translates to \"we\" and agrees with the subject-verb agreement in French."
    },
    {
      "time": 144.851,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic expression uses the present tense to convey a sense of habitual or general truth, rather than describing an actual action. The phrase \"on danse\" is equivalent to \"we do/dance\" in English, with the pronoun \"on\" (we) agreeing with the verb \"danse\"."
    },
    {
      "time": 148.998,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to convey a sense of habitual or general truth, rather than describing an actual action happening at a specific moment. The phrase is often used to express enthusiasm and agreement with someone's suggestion to dance."
    },
    {
      "time": 153.144,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to express a habitual or general truth, rather than describing an actual action happening at a specific moment. The phrase is often used to convey a sense of shared experience or communal activity."
    },
    {
      "time": 157.291,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic expression uses the present tense to convey a sense of habitual or general truth, rather than describing a specific action. The phrase is often used to express enthusiasm and agreement with an idea or situation."
    },
    {
      "time": 161.438,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "The phrase \"Alors on danse\" is an idiomatic expression, using the adverb \"alors\" to indicate a sudden change in action or mood, and the pronoun \"on\" (we) in the present tense, emphasizing the shared experience of dancing."
    },
    {
      "time": 165.585,
      "text": "Et la tu t'dis que c'est fini car pire que ça ce serait la mort.",
      "translation": "And then you think it's over because worse than that would be death.",
      "grammar": "The phrase \"pier que ça\" is an idiomatic expression meaning \"worse than this\" or \"even worse\", emphasizing the speaker's strong feeling of desperation."
    },
    {
      "time": 187.182,
      "text": "Quand tu crois enfin que tu t'en sors quand y en a plus et ben y en a encore!",
      "translation": "Just when you think you're finally getting out of it when there's nothing left, well, there's still more!",
      "grammar": "This idiomatic expression uses the present tense to convey a sense of ongoing struggle or situation, rather than describing a specific moment in time. The phrase \"y en a encore\" is an example of the French idiom \"il en reste\", which means \"there's still more\" or \"it's not over yet\"."
    },
    {
      "time": 212.519,
      "text": "Est-ce la zik ou les problèmes, les problèmes ou bien la musique.",
      "translation": "Is it the music or the problems, the problems or the music?",
      "grammar": "This sentence uses a rhetorical question to express uncertainty, with no specific tense indicated. The phrase \"ou bien\" is an idiomatic expression meaning \"or else\" or \"or rather\", emphasizing the speaker's ambiguity."
    },
    {
      "time": 229.13,
      "text": "Ca t'prends les trips ca te prends la tête et puis tu pries pour que ça s'arrête.",
      "translation": "It takes you on trips, it gets to your head, and then you pray for it to stop.",
      "grammar": "The use of \"ca\" in the phrase \"Ca t'prends les trips...\" is an idiomatic expression equivalent to \"it\" or \"something\", indicating that the subject is not specified but understood as a general phenomenon."
    },
    {
      "time": 253.221,
      "text": "Mais c'est ton corps c'est pas le ciel alors tu t'bouches plus les oreilles.",
      "translation": "But it's your body, not the sky, so don't cover your ears anymore.",
      "grammar": "The phrase \"tu t'bouches\" is an informal way of saying \"you stop\" or \"you no longer\", using the reflexive pronoun \"t'\" and the verb \"se boucher\" in the imperative mood."
    },
    {
      "time": 274.818,
      "text": "Et là tu cries encore plus fort et ca persiste...",
      "translation": "And then you scream even louder and it persists...",
      "grammar": "The use of \"et\" (and) to link two clauses in the same tense, indicating a continuation or consequence, is typical of French narrative style. This construction is often translated as \"and then\" in English."
    },
    {
      "time": 287.69,
      "text": "Alors on chante",
      "translation": "So we sing",
      "grammar": "This idiomatic phrase uses the present tense to express a general truth or habitual action, and the pronoun \"on\" is an informal way of saying \"we\"."
    },
    {
      "time": 291.837,
      "text": "Lalalalalala, Lalalalalala,",
      "translation": "Lalalalalala, Lalalalalala,",
      "grammar": "This interjection is an example of onomatopoeia, where the sound of the lyrics mimics the actual sound being described. The repetition of \"Lala\" creates a sense of musicality and playfulness."
    },
    {
      "time": 294.737,
      "text": "Alors on chante",
      "translation": "So we sing",
      "grammar": "This idiomatic phrase uses the present tense to express a habitual or general truth, rather than describing an actual action. The pronoun \"on\" is an informal second-person plural pronoun equivalent to \"we\"."
    },
    {
      "time": 298.884,
      "text": "Lalalalalala, Lalalalalala",
      "translation": "Lalalalalala, Lalalalalala",
      "grammar": "This line is an example of onomatopoeia, a linguistic device that imitates the sound it describes. The repetition of \"Lala\" creates a musical quality, emphasizing the joy and playfulness of the song."
    },
    {
      "time": 301.784,
      "text": "Alors on chante",
      "translation": "So we sing",
      "grammar": "This idiomatic phrase uses the present tense to express a habitual or general truth, rather than describing a specific action. The pronoun \"on\" is an impersonal subject pronoun equivalent to \"people\" or \"one\"."
    },
    {
      "time": 305.931,
      "text": "Alors on chante",
      "translation": "So we sing",
      "grammar": "This idiomatic expression uses the present tense to convey a habitual or general truth, rather than describing an actual action. The phrase \"on chante\" is equivalent to \"we always sing\" or \"people generally sing\"."
    },
    {
      "time": 310.077,
      "text": "Et puis seulement quand c'est fini, alors on danse",
      "translation": "And only when it's over, then we dance.",
      "grammar": "The phrase \"quand c'est fini\" is an idiomatic expression meaning \"when it's all said and done\" or \"after the fact\", using the present perfect tense to convey a sense of completion."
    },
    {
      "time": 322.949,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to express a habitual or general truth, rather than describing an actual action happening at a specific moment."
    },
    {
      "time": 327.096,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to convey a sense of habitual or general truth, rather than describing a specific action. The pronoun \"on\" is an informal, colloquial way to refer to oneself and others in French."
    },
    {
      "time": 331.243,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to convey a sense of habitual or routine action, rather than a specific moment in time. The pronoun \"on\" is an informal second-person plural, equivalent to \"you guys\" or \"y'all\"."
    },
    {
      "time": 335.39,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to convey a sense of habitual or general truth, rather than describing a specific action. The phrase is often used to express enthusiasm and agreement with a situation."
    },
    {
      "time": 339.536,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "The phrase \"Alors on danse\" is an idiomatic expression, where \"alors\" functions as a discourse marker indicating a shift in topic or tone, and \"on danse\" is the subject-verb agreement in the present tense, implying a sense of shared action."
    },
    {
      "time": 343.683,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to convey a sense of habitual or general truth, rather than describing a specific action. The pronoun \"on\" is an informal, second-person plural form equivalent to \"you guys\"."
    },
    {
      "time": 347.83,
      "text": "Alors on danse",
      "translation": "So we dance",
      "grammar": "This idiomatic phrase uses the present tense to convey a sense of habitual or general truth, rather than describing a specific action. The phrase is often used to express enthusiasm and agreement with someone's suggestion to dance."
    },
    {
      "time": 351.977,
      "text": "Et ben y en a encore",
      "translation": "Well, there are still some left.",
      "grammar": "The phrase \"y en a\" is an idiomatic expression used to indicate that something exists or remains. It's a present tense construction with a hint of surprise or irony, equivalent to saying \"and there are still some left\"."
    },
    {
      "time": 359.863,
      "text": "Et ben y en a encore",
      "translation": "Well, there are still some left.",
      "grammar": "The phrase \"y en a\" is an idiomatic expression used to indicate that something exists or happens. It's equivalent to saying \"there are\" in English, and the verb \"en avoir\" is in the imperfect tense, implying a general truth or a situation that may still be ongoing."
    },
    {
      "time": 367.749,
      "text": "Et ben y en a encore",
      "translation": "Well, there are still some left.",
      "grammar": "The phrase \"y en a\" is an idiomatic expression in French, equivalent to \"there are\" or \"there's still\". It uses the present tense to describe a situation that may not be currently true."
    },
    {
      "time": 375.635,
      "text": "Et ben y en a encore",
      "translation": "Well, there are still some left.",
      "grammar": "The phrase \"y en a\" is an idiomatic expression used to indicate that something exists or happens. It's a colloquial way of saying \"there are\" in the present tense, often used in informal conversations."
    },
    {
      "time": 383.521,
      "text": "Et ben y en a encore",
      "translation": "Well, there are still some left.",
      "grammar": "This idiomatic expression uses the present tense to convey a sense of ongoing situation, and \"y en a\" is an informal way to say \"there are\"."
    }
  ]
}