{
  "id": "pl_to_tylko_wiosna",
  "title": "To tylko wiosna",
  "artist": "Mata feat. Maryla Rodowicz",
  "level": "B2 (Upper Intermediate)",
  "from_language": "pl",
  "to_language": "en",
  "audio": "/audio/pl_to_tylko_wiosna.mp3",
  "duration": 235,
  "licensing_note": "Lyrics via Musixmatch API; translations via Google Translate API; grammar notes auto-generated placeholders.",
  "lines": [
    {
      "time": 0.0,
      "text": "Wypierdoliłem z klatki jak codziennie rano",
      "translation": "I got the fuck out of the cage like every morning",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I got the fuck out of the cage like every morning'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 2.648,
      "text": "Na nogach Adidasa klapki, idę do Żabki Nano",
      "translation": "I'm wearing Adidas flip-flops and going to Żabka Nano.",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I'm wearing Adidas flip-flops and going to Żabka Nano.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 6.079,
      "text": "Obok robotnicy, małpki już opierdalają",
      "translation": "Next to the workers, the monkeys are already messing around",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Next to the workers, the monkeys are already messing around'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 8.336,
      "text": "To samo widzę co dzień, codziennego życia szarość (thanks, Pedro)",
      "translation": "I see the same thing every day, the grayness of everyday life (thanks, Pedro)",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I see the same thing every day, the grayness of everyday life (thanks, Pedro)'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 12.55,
      "text": "Ja to ten dziwny przechodzień, co między słupkami slalom robi",
      "translation": "I am that strange passerby who does the slalom between the poles",
      "grammar": "Polish note: Verb focus: slalom (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I am that strange passerby who does the slalom between the poles'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 16.763,
      "text": "I patrzy pod nogi, bo podłoga bywa lawą",
      "translation": "And he looks at his feet, because the floor can be lava",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'And he looks at his feet, because the floor can be lava'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 20.194,
      "text": "Chodnik, kocham ten chodnik, obsrany",
      "translation": "The sidewalk, I love this sidewalk, it's covered in shit",
      "grammar": "Polish note: Verb focus: kocham (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'The sidewalk, I love this sidewalk, it's covered in shit'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 22.451,
      "text": "Na Ząbkowskiej, się pyta czy mi w chłodnik śmietany dać",
      "translation": "On Ząbkowska Street, he asks if he can put some cream in my cold soup.",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'On Ząbkowska Street, he asks if he can put some cream in my cold soup.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 26.665,
      "text": "Proste, huh, mówię że proste",
      "translation": "Simple, huh, I say simple",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Simple, huh, I say simple'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 28.922,
      "text": "Wolę w słoiku flaki, a nie w domu futomaki z wodorostem, ryż",
      "translation": "I prefer tripe in a jar, not homemade futomaki with seaweed and rice",
      "grammar": "Polish note: Verb focus: wodorostem (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I prefer tripe in a jar, not homemade futomaki with seaweed and rice'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 33.918,
      "text": "Znowu biorę ją dla beki, tam, gram na Nintendo Switch",
      "translation": "I'm taking it again for fun, there, I play on Nintendo Switch",
      "grammar": "Polish note: Verb focus: gram (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I'm taking it again for fun, there, I play on Nintendo Switch'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 38.132,
      "text": "Moja niunia bierze dziwne leki, a się nie leczy nic",
      "translation": "My baby is taking strange medications, but it doesn't cure anything.",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'My baby is taking strange medications, but it doesn't cure anything.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 42.345,
      "text": "Znowu ktoś pod blokiem rano krzyczy: \"Dajcie płodom żyć!\"",
      "translation": "Someone outside the block shouts again this morning: \"Let the fetuses live!\"",
      "grammar": "Polish note: Verb focus: blokiem, odom (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Someone outside the block shouts again this morning: \"Let the fetuses live!\"'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 46.168,
      "text": "Albo rolnicy lecą Szpaka, jakby to był hymn ich",
      "translation": "Or farmers play Szpak as if it was their anthem",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Or farmers play Szpak as if it was their anthem'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 49.99,
      "text": "Dzień Świra, albo Dzień Świstaka, co dzień w kraju tym",
      "translation": "Wacko Day, or Groundhog Day, is every day in this country",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Wacko Day, or Groundhog Day, is every day in this country'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 54.204,
      "text": "Gdzie mi się przyszło uczyć latać, i nie chciałbym w innym",
      "translation": "Where did I learn to fly, and I wouldn't want to do it any other way?",
      "grammar": "Polish note: Verb focus: przysz, innym (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Where did I learn to fly, and I wouldn't want to do it any other way?'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 58.809,
      "text": "Choć w radiu znów grają, że \"To tylko wiosna\"",
      "translation": "Even though they're playing on the radio again that \"It's Only Spring\"",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Even though they're playing on the radio again that \"It's Only Spring\"'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 62.631,
      "text": "W powietrzu czuć zapach już najlepszych dni",
      "translation": "The air already smells of the best days",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'The air already smells of the best days'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 65.671,
      "text": "Znam ciszę i krzyki, na imię mi Polska",
      "translation": "I know silence and screams, my name is Poland",
      "grammar": "Polish note: Verb focus: znam, cisz (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I know silence and screams, my name is Poland'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 69.101,
      "text": "A wszystko co było, znów wraca przez sny",
      "translation": "And everything that was, comes back again through dreams",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'And everything that was, comes back again through dreams'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 72.532,
      "text": "Kiedy patrzę na to co się dzieje w polskiej polityce, no to kurwa, niedowierzam",
      "translation": "When I look at what's happening in Polish politics, I can't fucking believe it.",
      "grammar": "Polish note: Verb focus: niedowierzam (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'When I look at what's happening in Polish politics, I can't fucking believe it.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 78.312,
      "text": "Dokąd to wszystko zmierza? Większy autorytet od papieża, ksiądz Mateusz z Sandomierza",
      "translation": "Where is all this heading? A greater authority than the Pope, Father Mateusz from Sandomierz",
      "grammar": "Polish note: Verb focus: mateusz (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Where is all this heading? A greater authority than the Pope, Father Mateusz from Sandomierz'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 83.308,
      "text": "Ma tu chyba jak powie słowo harcerza",
      "translation": "He's probably got a scout's word here",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'He's probably got a scout's word here'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 86.347,
      "text": "Pora wyjść ze średniowiecza wciąż zakuci w dybach, ci co przeszukiwano im plecak niech się zajmie tym Genewa",
      "translation": "It's time to get out of the Middle Ages, still chained in stocks, those who had their backpacks searched, let Geneva take care of it",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'It's time to get out of the Middle Ages, still chained in stocks, those who had their backpacks searched, let Geneva take care of it'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 93.692,
      "text": "Polską telewizję mimo likwidacji jebać, bo nie uczą się na błędach, nie kojarzę gorszej z debat",
      "translation": "Fuck Polish television despite its liquidation, because they don't learn from their mistakes, I don't remember a worse debate",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Fuck Polish television despite its liquidation, because they don't learn from their mistakes, I don't remember a worse debate'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 100.254,
      "text": "M-A-T, gorący temat, mogę się na wolno mierzyć z nimi",
      "translation": "M-A-T, hot topic, I can slowly face them",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'M-A-T, hot topic, I can slowly face them'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 105.25,
      "text": "Choć mój free w Campusie dużo gorszy jeszcze jest, niż ten Rusina, Wini",
      "translation": "Although my free time at Campus is much worse than that of Rusyn, Wini",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Although my free time at Campus is much worse than that of Rusyn, Wini'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 110.638,
      "text": "Byłem młodszy, wejść na test, nie teraz no to zobaczymy, czy coś więcej mogę wam dziś dać niż obietnicę, czyli",
      "translation": "I was younger, take the test, not now, let's see if I can give you something more today than a promise, that is",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I was younger, take the test, not now, let's see if I can give you something more today than a promise, that is'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 118.765,
      "text": "Gloryfikują faceta, tak mi mówił w ósme urodziny tata",
      "translation": "They glorify the guy, that's what my dad told me on my eighth birthday",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'They glorify the guy, that's what my dad told me on my eighth birthday'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 122.588,
      "text": "Od małego czuję to, że coś jest ze mną nie tak",
      "translation": "Since I was a child I have felt that something was wrong with me",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Since I was a child I have felt that something was wrong with me'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 127.193,
      "text": "Zapamiętaj ksywę M-A-T-A, czyli Mata",
      "translation": "Remember the nickname M-A-T-A, or Mata",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Remember the nickname M-A-T-A, or Mata'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 130.624,
      "text": "Jeśli nie daj Boże zginę za wcześnie, za małolata jeszcze",
      "translation": "If, God forbid, I die too early, too young",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'If, God forbid, I die too early, too young'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 134.837,
      "text": "I wiesz, kurwa, co, ostatnio coraz częściej przez to nie śpię",
      "translation": "And you know what, I've been losing sleep over it more and more lately.",
      "grammar": "Polish note: Verb focus: wiesz (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'And you know what, I've been losing sleep over it more and more lately.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 139.442,
      "text": "Bo za rogiem już 25, a przecież jestem dzieckiem",
      "translation": "Because around the corner it's already 25, and I'm still a child",
      "grammar": "Polish note: Verb focus: rogiem, jestem, dzieckiem (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Because around the corner it's already 25, and I'm still a child'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 143.265,
      "text": "Wychowanym na erze SoundClouda i na Vaporwave",
      "translation": "Raised on the SoundCloud era and Vaporwave",
      "grammar": "Polish note: Verb focus: wychowanym (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Raised on the SoundCloud era and Vaporwave'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 146.304,
      "text": "Większość z moich idoli umarła, będzie młoda wiecznie",
      "translation": "Most of my idols are dead, they will be young forever",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Most of my idols are dead, they will be young forever'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 149.735,
      "text": "I chyba właśnie przez to, chciałbym zostać prezydentem",
      "translation": "And I think that's why I'd like to become president.",
      "grammar": "Polish note: Verb focus: prezydentem (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'And I think that's why I'd like to become president.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 153.166,
      "text": "Potrzebuję nowe misje, które zdejmą z szyi pętlę",
      "translation": "I need new missions that will take the noose off my neck",
      "grammar": "Polish note: Verb focus: zdejm (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I need new missions that will take the noose off my neck'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 156.597,
      "text": "A zawiążą krawat, albo muchę, albo chain z orzełkiem (ja-ja, ja-ja-ja)",
      "translation": "And they will tie a tie, or a bow tie, or a chain with an eagle (yeah, yeah, yeah)",
      "grammar": "Polish note: Verb focus: kiem (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'And they will tie a tie, or a bow tie, or a chain with an eagle (yeah, yeah, yeah)'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 162.376,
      "text": "Choć w radiu znów grają, że \"To tylko wiosna\"",
      "translation": "Even though they're playing on the radio again that \"It's Only Spring\"",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Even though they're playing on the radio again that \"It's Only Spring\"'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 166.199,
      "text": "W powietrzu czuć zapach już najlepszych dni",
      "translation": "The air already smells of the best days",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'The air already smells of the best days'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 169.238,
      "text": "Znam ciszę i krzyki, na imię mi Polska",
      "translation": "I know silence and screams, my name is Poland",
      "grammar": "Polish note: Verb focus: znam, cisz (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I know silence and screams, my name is Poland'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 172.669,
      "text": "A wszystko co było, znów wraca przez sny",
      "translation": "And everything that was, comes back again through dreams",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'And everything that was, comes back again through dreams'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 176.1,
      "text": "Miałem nie zdawać, potem puchę grzać, a jestem GOAT-em",
      "translation": "I was supposed to fail the exam and then go to bed, but I'm the GOAT",
      "grammar": "Polish note: Verb focus: potem, jestem (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I was supposed to fail the exam and then go to bed, but I'm the GOAT'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 180.314,
      "text": "Dzwoni menadżer, że gaża, mamy milion za koncert",
      "translation": "The manager calls to say we have a million for the concert.",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'The manager calls to say we have a million for the concert.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 183.745,
      "text": "Nie idzie w parze z tym życiem, to co na horyzoncie",
      "translation": "What is on the horizon is not compatible with this life",
      "grammar": "Polish note: Verb focus: yciem (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'What is on the horizon is not compatible with this life'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 188.35,
      "text": "Możemy wydać ci płytę \"Nie będę Twoim ojcem\"",
      "translation": "We can release the album \"I Won't Be Your Father\" for you.",
      "grammar": "Polish note: Verb focus: twoim, ojcem (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'We can release the album \"I Won't Be Your Father\" for you.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 191.781,
      "text": "Miasto Warszawa, jak wszędzie, raz pada, a raz słońce",
      "translation": "The city of Warsaw, like everywhere, sometimes it rains and sometimes it is sunny.",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'The city of Warsaw, like everywhere, sometimes it rains and sometimes it is sunny.'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 195.603,
      "text": "Zeszliście na manowce, to tylko jak w stadzie owce",
      "translation": "You have gone astray, it's just like sheep in a flock",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'You have gone astray, it's just like sheep in a flock'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 199.425,
      "text": "Dużo wam dałem na mnożenie, hajsu z rapu wzorce",
      "translation": "I gave you a lot for multiplication, rap money patterns",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I gave you a lot for multiplication, rap money patterns'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 203.247,
      "text": "Pojebaliście proporcje w swej kserokopiarce, yeah",
      "translation": "You've fucked up the proportions on your copier, yeah",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'You've fucked up the proportions on your copier, yeah'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 205.896,
      "text": "Choć w radiu znów grają, że \"To tylko wiosna\"",
      "translation": "Even though they're playing on the radio again that \"It's Only Spring\"",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Even though they're playing on the radio again that \"It's Only Spring\"'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 209.718,
      "text": "W powietrzu czuć zapach już najlepszych dni",
      "translation": "The air already smells of the best days",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'The air already smells of the best days'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 212.758,
      "text": "Znam ciszę i krzyki, na imię mi Polska",
      "translation": "I know silence and screams, my name is Poland",
      "grammar": "Polish note: Verb focus: znam, cisz (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I know silence and screams, my name is Poland'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 216.188,
      "text": "A wszystko co było, znów wraca przez sny",
      "translation": "And everything that was, comes back again through dreams",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'And everything that was, comes back again through dreams'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 219.619,
      "text": "Choć w radiu znów grają, że \"To tylko wiosna\"",
      "translation": "Even though they're playing on the radio again that \"It's Only Spring\"",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'Even though they're playing on the radio again that \"It's Only Spring\"'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 223.442,
      "text": "W powietrzu czuć zapach już najlepszych dni (ja-ja, ja-ja-ja)",
      "translation": "The air already smells of the best days (me-me, me-me-me)",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'The air already smells of the best days (me-me, me-me-me)'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 228.438,
      "text": "Znam ciszę i krzyki, na imię mi Polska",
      "translation": "I know silence and screams, my name is Poland",
      "grammar": "Polish note: Verb focus: znam, cisz (check person/tense and prefixes). Aspect pairs and rich case system; endings mark person/tense. Meaning: 'I know silence and screams, my name is Poland'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    },
    {
      "time": 231.869,
      "text": "A wszystko co było, znów wraca przez sny",
      "translation": "And everything that was, comes back again through dreams",
      "grammar": "Polish note: Identify the main verb, its ending, and any prefix movement. Aspect pairs and rich case system; endings mark person/tense. Meaning: 'And everything that was, comes back again through dreams'. Highlight any set phrase to memorize and how the verb agrees with the subject."
    }
  ]
}