{
  "id": "ru__8",
  "title": "Дешёвые драмы",
  "artist": "Валентин Стрыкало",
  "level": "B2 (Upper Intermediate)",
  "from_language": "ru",
  "to_language": "en",
  "audio": "/audio/ru_.mp3",
  "duration": 228,
  "licensing_note": "Lyrics fetched via Musixmatch API; translations via local Ollama.",
  "lines": [
    {
      "time": 18.82919999998808,
      "text": "Мы так любим дешёвые драмы",
      "translation": "We love cheap dramas so much",
      "grammar": "The phrase \"так любим\" is an idiomatic expression indicating strong affection or enthusiasm, equivalent to \"so much\" in English. The verb \"любим\" is in the present tense and agrees with the plural subject \"мы\"."
    },
    {
      "time": 22.98129999998212,
      "text": "С непродуманными диалогами",
      "translation": "With ill-conceived dialogues",
      "grammar": "The phrase \"с непродуманными\" is an idiomatic expression indicating a negative opinion about something, in this case, the dialogues. The use of the preposition \"с\" with the adjective \"непродуманными\" implies a strong disapproval or criticism."
    },
    {
      "time": 26.947,
      "text": "Где актёры немножечко переиграли",
      "translation": "Where the actors overacted a little",
      "grammar": "The phrase \"немножечко\" is an adverbial idiom that indicates a slight or moderate degree of something, often used to soften the intensity of an action. In this context, it implies that the actors' overacting was not extreme but rather noticeable."
    },
    {
      "time": 31.1825,
      "text": "Со вздохами, криками, стонами",
      "translation": "With sighs, screams, groans",
      "grammar": "This phrase uses the idiomatic expression \"with\" to convey a sense of accompaniment or association, rather than indicating a specific time or manner. The use of nouns (sighs, screams, groans) in this phrase creates a vivid and emotive picture."
    },
    {
      "time": 35.353099999994036,
      "text": "Где мы, не увлечённые ролью",
      "translation": "Where are we, not carried away by the role",
      "grammar": "The phrase \"не увлечённые\" is in the present passive voice, indicating a state or condition that exists at the moment of speaking. The use of \"не\" negates the idea of being fully engaged or absorbed in the role."
    },
    {
      "time": 38.74490000000596,
      "text": "В дурацких костюмах со скoванной грацией",
      "translation": "In silly costumes with constrained grace",
      "grammar": "The phrase \"дурацкие\" is an adjective used to describe the nouns \"костюмы\", employing a colloquial idiom that conveys a sense of playfulness and whimsy. The use of \"со скoванной грацией\" emphasizes the artificial nature of the characters' movements, implying a lack of natural elegance."
    },
    {
      "time": 43.62709999999404,
      "text": "От бульварного прячемся шума",
      "translation": "We hide from the boulevard noise",
      "grammar": "This idiomatic expression uses the verb \"прячемся\" (to hide) in the reflexive form, indicating a habitual or customary action (\"we hide ourselves from\")."
    },
    {
      "time": 47.85,
      "text": "В обшарпанных декорациях",
      "translation": "In shabby scenery",
      "grammar": "The phrase \"обшарпанные\" is an adjective in the nominative case, describing the noun \"декорации\". It is used to convey a sense of something being worn out or in disrepair."
    },
    {
      "time": 53.926799999982116,
      "text": "Сцены ревности, сцены разлуки",
      "translation": "Scenes of jealousy, scenes of separation",
      "grammar": "The phrase uses the present participle form сцены (scenarios) to convey a sense of ongoing or repeated actions, emphasizing the intensity and drama of the emotions."
    },
    {
      "time": 58.10619999998808,
      "text": "Мы готовы, мы с текстом сверились",
      "translation": "We are ready, we checked the text.",
      "grammar": "The phrase \"мы готовы\" is in the present tense and indicates a state of readiness, emphasizing the speakers' preparedness. The use of the same verb form (\"мы готовы\") for both clauses creates a sense of unity and emphasizes their shared preparedness."
    },
    {
      "time": 62.407,
      "text": "Мы как будто не знали друг друга",
      "translation": "It was as if we didn't know each other",
      "grammar": "This idiomatic phrase uses the present perfect tense to convey a sense of sudden realization, implying that the speaker and someone else were unaware of their connection until this moment. The phrase \"как будто\" is an adverbial construction indicating a hypothetical or conditional situation."
    },
    {
      "time": 65.88340000000596,
      "text": "Мы как будто... случайно встретились",
      "translation": "It's like we met by chance.",
      "grammar": "The phrase \"как будто\" is an idiomatic expression indicating a hypothetical or conditional situation, often used to describe unexpected events. In this context, it implies that the speaker and someone else had a coincidental encounter."
    },
    {
      "time": 75.80259999999404,
      "text": "Скорей бы всё кончилось, и мы забудем",
      "translation": "I wish it would all end soon and we would forget",
      "grammar": "The phrase \"Скорей бы\" is an idiomatic expression used to convey a sense of urgency or impatience, equivalent to \"I wish it would happen soon\". The verb \"бы\" is in the subjunctive mood, indicating a hypothetical or desired situation."
    },
    {
      "time": 79.69769999998807,
      "text": "Свой текст и разъедемся по домaм",
      "translation": "Write your text and we'll go home.",
      "grammar": "The phrase \"разъедемся\" is an informal, colloquial way to say \"let's go\" in English, using the first person plural verb form \"разъедемся\" (we will go) with a sense of informality and friendliness."
    },
    {
      "time": 84.36179999998213,
      "text": "Чтоб в кадр попали опять не те люди",
      "translation": "So that the wrong people get into the frame again",
      "grammar": "The phrase \"чтобы\" is used to express a purpose or intention, indicating the speaker's desire for something to happen. In this context, it functions as a subordinate conjunction in the subjunctive mood, implying a hypothetical situation."
    },
    {
      "time": 88.34529999998212,
      "text": "Которых хотелось бы видеть там",
      "translation": "Which I would like to see there",
      "grammar": "This sentence uses the hypothetical subjunctive mood, implying a desire or wish rather than a factual statement. The phrase \"хотелось бы\" is an idiomatic expression translating to \"I would like\"."
    },
    {
      "time": 92.7525,
      "text": "Давай, поцелуй меня нежно, насколько",
      "translation": "Come on, kiss me tenderly, as much as possible",
      "grammar": "The phrase \"насколько\" is an idiom translating to \"as much as possible\", used to emphasize the extent of something. It's often employed in informal settings and adds a touch of playfulness to the request."
    },
    {
      "time": 96.67940000000596,
      "text": "Ты можешь, слезу вытри рукавом",
      "translation": "You can wipe away your tears with your sleeve.",
      "grammar": "The phrase \"слезу вытри\" uses the imperfective aspect to convey a habitual or repeated action of wiping away tears, rather than a one-time event."
    },
    {
      "time": 101.05359999999403,
      "text": "Пусть старые камеры вечно рвут плёнку",
      "translation": "Let the old cameras forever tear the film",
      "grammar": "The phrase \"пусть\" is a polite imperative, used to express a wish or permission, and its tense matches the general tone of the sentence. The idiom \"вечно рвут\" conveys the idea of something happening continuously into the future."
    },
    {
      "time": 105.02879999998211,
      "text": "Мы сможем сыграть это заново",
      "translation": "We can play this again",
      "grammar": "The verb \"сможем\" is in the present tense, indicating a possibility or ability to perform an action. The phrase \"сыграть это заново\" uses the idiom \"играть заново\" meaning \"to replay\" or \"to do something again\"."
    },
    {
      "time": 110.91179999998212,
      "text": "Сцены ревности, сцены разлуки",
      "translation": "Scenes of jealousy, scenes of separation",
      "grammar": "The phrase uses the present participle forms \"ревности\" and \"разлуки\" to convey a sense of ongoing or repeated actions, emphasizing the intensity of the emotions."
    },
    {
      "time": 114.9675,
      "text": "Мы готовы, мы с текстом сверились",
      "translation": "We are ready, we checked the text.",
      "grammar": "The phrase \"мы готовы\" is in the present tense, indicating a state of readiness. The use of \"мы\" (we) and \"готовы\" (ready) agrees with the subject-verb agreement rules in Russian."
    },
    {
      "time": 119.74309999999404,
      "text": "Мы как будто не знали друг друга",
      "translation": "It was as if we didn't know each other",
      "grammar": "This idiomatic phrase uses the subjunctive mood to express a hypothetical or uncertain situation, implying that even though they were together, it felt like they were strangers. The use of \"как будто\" (as if) creates a sense of uncertainty and emphasizes the speaker's perception of their relationship."
    },
    {
      "time": 122.81840000000597,
      "text": "Мы как будто... случайно встретились",
      "translation": "It's like we met by chance.",
      "grammar": "The phrase \"как будто\" is an idiom used to express a hypothetical or uncertain situation, similar to the English expression \"as if\" or \"like\". It indicates that something happened unexpectedly or coincidentally."
    },
    {
      "time": 132.75879999998213,
      "text": "Искусственных слёз нам хватает, но вроде",
      "translation": "We have enough artificial tears, but it seems",
      "grammar": "The phrase \"вроде\" is an idiomatic expression translating to \"it seems\" or \"apparently\", used to convey a tentative or uncertain impression."
    },
    {
      "time": 136.68419999998807,
      "text": "Надо плакать, а мы улыбаемся",
      "translation": "We should cry, but we smile",
      "grammar": "This idiomatic expression uses the imperative mood to convey a sense of obligation or necessity (\"Надо\" means \"should\" or \"must\"), contrasting with the actual behavior described in the sentence."
    },
    {
      "time": 140.9327999999821,
      "text": "Может быть, эти роли нам не подходят",
      "translation": "Maybe these roles are not right for us.",
      "grammar": "The phrase \"могут быть\" is a polite way to express doubt or uncertainty in Russian, equivalent to the English idiom \"maybe\" or \"perhaps\". It's used to soften the tone of a statement and show that you're open to alternative possibilities."
    },
    {
      "time": 145.3497999999821,
      "text": "И зря мы так сильно стараемся",
      "translation": "And it’s in vain that we try so hard",
      "grammar": "This idiom \"зря\" (in vain) is used to express the futility of an action, implying that one's efforts are not yielding the desired results."
    },
    {
      "time": 149.33340000000595,
      "text": "Честно плачут лишь те, кто ломают и строят",
      "translation": "Only those who break and build cry honestly.",
      "grammar": "This idiomatic phrase uses the present tense to convey a general truth about human nature, rather than describing a specific event. The verb \"плачут\" (cry) is in the third person plural form, emphasizing that this is a universal phenomenon."
    },
    {
      "time": 153.25079999998212,
      "text": "Я прошу, ведь сценарий писали вы",
      "translation": "I'm asking, because you wrote the script.",
      "grammar": "The phrase \"ведь\" is an adverbial conjunction used to introduce a reason or explanation, equivalent to \"because\" in English. It's often translated as \"since\" or \"for\"."
    },
    {
      "time": 157.30829999998213,
      "text": "Пообещайте, что наши герои",
      "translation": "Promise that our heroes",
      "grammar": "The phrase \"Пообещайте\" is an imperative mood, instructing someone to promise something. The use of the verb \"обещать\" in this context implies a sense of urgency or importance, emphasizing the need for a promise to be made."
    },
    {
      "time": 161.73440000000596,
      "text": "В конце останутся счастливы",
      "translation": "In the end they will remain happy",
      "grammar": "The verb \"останутся\" is in the future perfect tense, indicating that the happiness will be a lasting result of some action."
    },
    {
      "time": 167.40229999998212,
      "text": "Сцены ревности, сцены разлуки",
      "translation": "Scenes of jealousy, scenes of separation",
      "grammar": "The phrase \"сцены\" is used idiomatically to refer to dramatic or intense situations, rather than literal scenes. The use of the plural noun \"сцены\" with the indefinite article \"сцены\" emphasizes the frequency and variety of these emotional experiences."
    },
    {
      "time": 171.51529999998212,
      "text": "Мы готовы, мы с текстом сверились",
      "translation": "We are ready, we checked the text.",
      "grammar": "The phrase \"мы готовы\" is in the present tense and implies a sense of preparedness or willingness, using the idiomatic expression \"готовы\" to convey readiness."
    },
    {
      "time": 176.021,
      "text": "Мы как будто не знали друг друга",
      "translation": "It was as if we didn't know each other",
      "grammar": "This idiomatic phrase uses the present perfect tense to convey a sense of sudden realization, implying that the speaker and someone else had been unaware of each other's presence until this moment. The phrase \"как будто\" is an adverbial construction indicating a hypothetical or conditional situation."
    },
    {
      "time": 178.7512999999821,
      "text": "Мы как будто... случайно встретились",
      "translation": "It's like we met by chance.",
      "grammar": "The phrase \"как будто\" is an idiomatic expression indicating a hypothetical or imaginary situation, often used to convey a sense of surprise or coincidence. In this context, it functions as a subordinate conjunction, introducing a dependent clause that describes the unexpected nature of their meeting."
    },
    {
      "time": 188.60309999999404,
      "text": "Мы так любим дешёвые драмы",
      "translation": "We love cheap dramas so much",
      "grammar": "The phrase \"так любим\" is an idiomatic expression, where \"так\" intensifies the meaning of \"любим\", implying a strong affection. The verb \"любим\" is in the present tense, indicating a habitual or general feeling."
    },
    {
      "time": 192.76519999998808,
      "text": "Со смешными проблемами нашими",
      "translation": "With our funny problems",
      "grammar": "The phrase \"смешные\" (funny) is used to describe a type of problem, implying that the issues are not serious or significant. This usage is an idiom in Russian, where \"смешный\" can also mean \"amusing\" or \"ridiculous\"."
    },
    {
      "time": 197.159,
      "text": "Да, играем мы препогано",
      "translation": "Yes, we play very badly.",
      "grammar": "The phrase \"играем мы\" is in the present tense and uses the first-person plural pronoun \"мы\" to indicate that the speaker and others are playing together. The idiomatic expression \"препогано\" means \"very badly\", rather than literally \"preposterously\"."
    },
    {
      "time": 201.51259999999405,
      "text": "Вот только любим пo-настоящему, yeah",
      "translation": "We just love for real, yeah",
      "grammar": "The phrase \"по-настоящему\" is an idiom translating to \"for real\", used to emphasize authenticity or sincerity. It's often used in informal settings and can be replaced with \"seriously\" or \"honestly\"."
    }
  ]
}